pmo-dataset/graphviz/07.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Send ticket via\nemail" -> "ExclusiveGateway_8";
  "Provide personal\ninformation" -> "ParallelGateway_3";
  "Customer completes\njourney" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Select date and time";
  "ExclusiveGateway_6" -> "ExclusiveGateway_9";
  "ExclusiveGateway_12" -> "ParallelGateway_4";
  "ExclusiveGateway_8" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ExclusiveGateway_3" -> "end";
  "ParallelGateway_1" -> "ExclusiveGateway_11";
  "ExclusiveGateway_11" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "ExclusiveGateway_3";
  "ExclusiveGateway_10" -> "ExclusiveGateway_12";
  "Select date and time" -> "ParallelGateway_5";
  "Update seat\ninventory" -> "ParallelGateway_1";
  "Send instructions" -> "ExclusiveGateway_6";
  "Send reminder" -> "ExclusiveGateway_10";
  "ExclusiveGateway_9" -> "Send instructions";
  "ExclusiveGateway_2" -> "ParallelGateway_4";
  "ParallelGateway_2" -> "Select route";
  "ParallelGateway_6" -> "Update seat\ninventory";
  "ParallelGateway_4" -> "Customer completes\njourney";
  "ExclusiveGateway_11" -> "ExclusiveGateway_12";
  "ExclusiveGateway_4" -> "Send reminder";
  "ParallelGateway_3" -> "Generate ticket";
  "ExclusiveGateway_7" -> "Send ticket via SMS";
  "ParallelGateway_6" -> "ExclusiveGateway_7";
  "ExclusiveGateway_10" -> "ExclusiveGateway_4";
  "Generate ticket" -> "ParallelGateway_6";
  "Provide payment\ndetails" -> "ParallelGateway_3";
  "ExclusiveGateway_1" -> "ExclusiveGateway_9";
  "ExclusiveGateway_5" -> "Post-travel feedback\nor services";
  "start" -> "Customer searches\nfor ticket";
  "ParallelGateway_5" -> "Provide personal\ninformation";
  "Customer searches\nfor ticket" -> "ParallelGateway_2";
  "ParallelGateway_5" -> "Provide payment\ndetails";
  "Post-travel feedback\nor services" -> "ExclusiveGateway_3";
  "ParallelGateway_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_7" -> "Send ticket via\nemail";
  "ExclusiveGateway_6" -> "ExclusiveGateway_2";
  "Select route" -> "ParallelGateway_5";
  "Send ticket via SMS" -> "ExclusiveGateway_8";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "ExclusiveGateway_9" [label="X", shape=diamond];
  "ExclusiveGateway_10" [label="X", shape=diamond];
  "ExclusiveGateway_11" [label="X", shape=diamond];
  "ExclusiveGateway_12" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
}
