pmo-dataset/mermaid/07.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	Task_2["Send ticket via\nemail"] --> ExclusiveGateway_8{"X"}
	Task_8["Provide personal\ninformation"] --> ParallelGateway_3{"+"}
	Task_4["Customer completes\njourney"] --> ExclusiveGateway_5{"X"}
	ParallelGateway_2{"+"} --> Task_7["Select date and time"]
	ExclusiveGateway_6{"X"} --> ExclusiveGateway_9{"X"}
	ExclusiveGateway_12{"X"} --> ParallelGateway_4{"+"}
	ExclusiveGateway_8 --> ParallelGateway_1{"+"}
	ExclusiveGateway_1{"X"} --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"} --> EndNoneEvent_1(("end")):::endEvent
	ParallelGateway_1 --> ExclusiveGateway_11{"X"}
	ExclusiveGateway_11 --> ExclusiveGateway_4{"X"}
	ExclusiveGateway_5 --> ExclusiveGateway_3
	ExclusiveGateway_10{"X"} --> ExclusiveGateway_12
	Task_7 --> ParallelGateway_5{"+"}
	Task_10["Update seat\ninventory"] --> ParallelGateway_1
	Task_11["Send instructions"] --> ExclusiveGateway_6
	Task_6["Send reminder"] --> ExclusiveGateway_10
	ExclusiveGateway_9 --> Task_11
	ExclusiveGateway_2 --> ParallelGateway_4
	ParallelGateway_2 --> Task_1["Select route"]
	ParallelGateway_6{"+"} --> Task_10
	ParallelGateway_4 --> Task_4
	ExclusiveGateway_11 --> ExclusiveGateway_12
	ExclusiveGateway_4 --> Task_6
	ParallelGateway_3 --> Task_9["Generate ticket"]
	ExclusiveGateway_7{"X"} --> Task_13["Send ticket via SMS"]
	ParallelGateway_6 --> ExclusiveGateway_7
	ExclusiveGateway_10 --> ExclusiveGateway_4
	Task_9 --> ParallelGateway_6
	Task_5["Provide payment\ndetails"] --> ParallelGateway_3
	ExclusiveGateway_1 --> ExclusiveGateway_9
	ExclusiveGateway_5 --> Task_3["Post-travel feedback\nor services"]
	StartNoneEvent_1(("start")) --> Task_12["Customer searches\nfor ticket"]
	ParallelGateway_5 --> Task_8
	Task_12 --> ParallelGateway_2
	ParallelGateway_5 --> Task_5
	Task_3 --> ExclusiveGateway_3
	ParallelGateway_1 --> ExclusiveGateway_1
	ExclusiveGateway_7 --> Task_2
	ExclusiveGateway_6 --> ExclusiveGateway_2
	Task_1 --> ParallelGateway_5
	Task_13 --> ExclusiveGateway_8
